Repository: ByteParty/digas-fe-management
Catalog: Resources/Private/Language/Overrides/*.locallang_fe_change_pwd.xlf
Languages: de

# passwordFieldsEmptyOrNotBothFilledOut
source: You must fill out both password fields
de: Bitte füllen Sie beide Passwortfelder aus

# passwordsDoNotMatch
source: The passwords do not match
de: Die Passwörter stimmen nicht überein

# passwordComplexity.failure.minLength
source: The password must at least have a length of %1s chars
de: Das Passwort muss mindestens %1s Zeichen lang sein

# passwordComplexity.failure.capitalCharCheck
source: The password must at least contain one capital char
de: Das Passwort muss mindestens ein Großbuchstaben enthalten

# passwordComplexity.failure.lowerCaseCharCheck
source: The password must at least contain one lower case char
de: Das Passwort muss mindestens ein Kleinbuchstaben enthalten

# passwordComplexity.failure.digitCheck
source: The password must at least contain one digit
de: Das Passwort muss mindestens eine Ziffer enthalten

# passwordComplexity.failure.specialCharCheck
source: The password must at least contain one special char
de: Das Passwort muss mindestens ein Sonderzeichen enthalten

# pwnedPasswordFailure
source: Dieses Passwort ist in einemDaten-Leak enthalten und wurde %1s Mal in der Datenbank haveibeenpwned.com gefunden. Bitte wählen Sie ein anderes Passwort.
de: Ihr Passwort wurde in einem

# oldPasswordFailure
source: This password can not be used, because it equals the old password.
de: Das Passwort kann nicht verwendet werden, weil es dem alten PAsswort entspricht.

# passwordUpdated
source: The password has been updated
de: Das Passwort wurde aktualisiert

# passwordUpdated.title
source: Password updated
de: Passwort aktualisiert

source: Current Password
de: Aktuelles Passwort

source: Password
de: Passwort

source: Repeat Password
de: Passwort wiederholen

# validationErrorHeader
source: Please check your input for the following errors:
de: Bitte überprüfen Sie Ihre Eingabe auf folgende Fehler:

# changePasswordReason.forcedChange
source: You must change your password
de: Sie müssen Ihr Passwort ändern

# changePasswordReason.passwordExpired
source: Your password has expired and must be changed
de: Ihr Passwort ist nicht mehr gültig und muss neu vergeben werden.

# notLoggedIn
source: You need to be logged in to update your password
de: Sie müssen eingeloggt sein um ihr Passwort ändern zu können

# currentPasswordEmpty
source: Please enter your current password in the corresponding field.
de: Bitte geben sie ihr Passwort ein.

# currentPasswordFailure
source: The current password you entered is wrong.
de: Das eingegebene Passwort ist falsch.
